
== Working with Collections

image:http://assets.neo4j.org/img/neo4j_logo.png[] Version 1.0 - Dan F.

Collections (lists) are a Cypher feature that you should be comfortable with.

Basic collections using Cypher

A collection can be composed multiple ways.
//setup
//output
[source,cypher,subs=attributes]
RETURN [1,2,3,4] as literalCollection,
range(1,10) as rangeCollection, range(1,10,2) AS rangeStepCollection,
[1,2, 'a', {x: 1}, [3,4]] as mixedTypeCollection

Collections can be sliced

Return the first element:

//setup
//output
[source,cypher,subs=attributes]
RETURN [1,2,3,4][0]

Return the last element:

//setup
//output
[source,cypher,subs=attributes]
RETURN [1,2,3,4][-1]

Return the second to last element

//setup
//output
[source,cypher,subs=attributes]
RETURN [1,2,3,4][-2]

Collections can be iterated

//setup
//output
[source,cypher,subs=attributes]
RETURN [x IN range(1,5) | x ]

Adding computation on the return

//setup
//output
[source,cypher,subs=attributes]
RETURN [x IN range(1,5) | x*x ]

Including a 'WHERE' clause to square only even numbers

//setup
//output
[source,cypher,subs=attributes]
RETURN [x IN range(1,20) WHERE x % 2 = 0 | x*x ]

The 'reduce' function starts with an accumulator, in this case 'acc' to sum
up all the values in the range 1..20

//setup
//output
[source,cypher,subs=attributes]
RETURN reduce(acc = 0, x IN range(1,20) | acc + x ) AS sum

Or for string manipulation using the '+' concatenation operator

//setup
//output
[source,cypher,subs=attributes]
WITH reduce(str = "", x IN range(1,20) | str + "," + toString(x) ) AS string
RETURN right(string, size(string) - 1)

== Using Predicates

'all()' requires all elements meet a criteria.  Try changing 'range(1,9)' to
'range(1,10)'.

//setup
//output
[source,cypher,subs=attributes]
WITH range(1,9) AS list
WHERE ALL(x IN list WHERE x < 10)
WITH [x IN list WHERE x % 2 = 0 | x*x ] as squares
UNWIND squares AS s
RETURN s

'any()' returns true if the predicate holds for at least one element in the
given list.

This does not work:

//setup
//output
[source,cypher,subs=attributes]
WITH range(1,9) AS list
WHERE ANY(x in [20,10] WHERE x IN list)
WITH [x IN list WHERE x % 2 = 0 | x*x ] as squares
UNWIND squares AS s
RETURN s

While this does:

//setup
//output
[source,cypher,subs=attributes]
WITH range(1,9) AS list
WHERE ANY(x in [20,10] WHERE x IN list)
WITH [x IN list WHERE x % 2 = 0 | x*x ] as squares
UNWIND squares AS s
RETURN s

'exists()' returns true if a match for the given pattern exists in the graph,
or if the specified property exists in the node, relationship or map.

This query returns :Person nodes that have the 'died' property and the ':Person'
node has the relationship '[:DIRECTED]'

//setup
//output
[source,cypher,subs=attributes]
MATCH (n:Person)
WHERE exists(n.died)
RETURN n.name AS name, n.died as `anno mortuus est`, exists((n)-[:DIRECTED]->()) AS isDirector

The other predicate operators are

* 'none()' returns true if the predicate holds for no element in the given list.
* 'single()'  returns true if the predicate holds for exactly one of the
elements in the given list.

== APOC's and collections

Often there's a need to manipulate a collection of data returned as part of a
Cypher query.  Often this can be done in Cypher, but there's not explicit list
manipulation built into Cypher.  Of course there's apoc's that exist to do this
type of work.  Here's a few examples of sorting, summation, and other
manipulations using the 'apoc.coll.*' functions.  See the "Collection Function"
section of the Neo4j APOC documentation
....
https://neo4j-contrib.github.io/neo4j-apoc-procedures/#collection-list-functions
....

There's sum, avg, min, and max:name: value

//setup
//output
[source,cypher,subs=attributes]
RETURN apoc.coll.sum(range(1,20))

Lists can be combined (note the pairs will be truncated to the shortest list):

//setup
//output
[source,cypher,subs=attributes]
RETURN apoc.coll.zip(range(1,5),range(10,20))

Get the unique set of values:
//setup
//output
[source,cypher,subs=attributes]
RETURN apoc.coll.toSet([1, 2, 3, 4, 5, 3, 4, 5, 6])

Sort maps (note where the key pair for 'b' ends up):

//setup
//output
RETURN apoc.coll.sortMaps([{b:7},{a:10},{a:1},{a:4}], 'a')

There's much more you can do with collections, including contains tests,
intersections, unions, etc.  See the documentation for details.
